:- dynamic кандидат/1.

% Пример кандидата ИВАН:
кандидат(иван) :-
    язык_программирования(python),
    уровень_опыта(middle),
    опыт_работы(3),
    формат_работы(удаленка),
    зп(30000).

% Пример кандидата МАРИЯ (с двумя языками):
кандидат(мария) :-
    язык_программирования(java),
    уровень_опыта(senior),
    опыт_работы(7),
    формат_работы(очно),
    зп(50000).


% Пример кандидата СЕМЕН (несколько языков):
кандидат(семен) :-
    язык_программирования(python),
    уровень_опыта(middle),
    опыт_работы(5),
    формат_работы(очно),
    зп(40000).

% Пример кандидата САША:
кандидат(саша) :-
    язык_программирования(prolog),
    уровень_опыта(junior),
    опыт_работы(1),
    формат_работы(удаленка),
    зп(30000).


%% Новый кандидат
кандидат(михаил) :-
    язык_программирования(cpp),
    уровень_опыта(senior),
    опыт_работы(10),
    формат_работы(удалёнка),
    зп(100000).
