:- dynamic option/2.

% Опции для языка программирования (оставляем без изменений)
option(язык_программирования, python).
option(язык_программирования, java).


% Опции для уровня опыта
option(уровень_опыта, junior).
option(уровень_опыта, middle).
option(уровень_опыта, senior).

% Опции для опыта работы (числовые значения)
option(опыт_работы, 1).
option(опыт_работы, 3).
option(опыт_работы, 5).
option(опыт_работы, 7).
option(опыт_работы, 9).
option(опыт_работы, 10).

% Опции для формата работы
option(формат_работы, удаленка).
option(формат_работы, очно).

% Опции для зп (числовые значения)
option(зп, 30000).
option(зп, 40000).
option(зп, 50000).
option(зп, 60000).




option(язык_программирования, cpp).
option(зп, 100000).

option(формат_работы, удалёнка).
